app/views/admin/albums/index.html.slim

          = image_tag "#{item.cover_url(:thumb)}"
      td = item.pictures.count
---
SELECT COUNT(*) FROM `pictures`  WHERE `pictures`.`album_id` = 11