app/controllers/admin/albums_controller.rb

  def index
    @albums = Album.order('id DESC').page(params[:page]).per(20)
---
SELECT  `albums`.* FROM `albums`   ORDER BY id DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `albums`