app/controllers/admin/articles_controller.rb

SELECT  `articles`.* FROM `articles`  WHERE (title LIKE '%%')  ORDER BY id DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `articles`  WHERE (title LIKE '%%')
---
  def index
    @articles = Article.where('title LIKE ?', "%#{params[:title]}%").order('id DESC').page(params[:page]).per(20)

SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 141 LIMIT 1
---
  def set_visit
    article = Article.find(params[:id])