app/controllers/admin/clubs_controller.rb

SELECT COUNT(DISTINCT `clubs`.`id`) FROM `clubs` LEFT OUTER JOIN `inviters` ON `inviters`.`user_id` = `clubs`.`user_id`
---
  def index
    @items = Club.eager_load(:inviter).order('lives_count desc').page(params[:page]).per(20)