app/controllers/admin/orders_controller.rb

SELECT  `orders`.* FROM `orders`   ORDER BY created_at desc LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM `orders`
---
  def index
    @orders = Order.order("created_at desc").page(params[:page]).per(15)