app/controllers/admin/sms_controller.rb

  def index
    unless params[:keyword].blank?
      @sms_records = SmsRecord.where('has_sent = ?', params[:keyword])
                   .order('id DESC').page(params[:page]).per(100)
---
SELECT  `sms_records`.* FROM `sms_records`  WHERE (id >= 1)  ORDER BY id DESC LIMIT 100 OFFSET 0
SELECT COUNT(*) FROM `sms_records`  WHERE (id >= 1)

  def new
    @sms_record = SmsRecord.new
    @selected_sms_users = SelectedSmsUsers.where('id >= 1')
                          .order('user_id DESC').page(params[:page]).per(100)
---
SELECT  `selected_sms_users`.* FROM `selected_sms_users`  WHERE (id >= 1)  ORDER BY user_id DESC LIMIT 100 OFFSET 0
SELECT COUNT(*) FROM `selected_sms_users`  WHERE (id >= 1)