app/controllers/admin/users_controller.rb

SELECT `users`.* FROM `users`  WHERE (agent=1 )
SELECT  `users`.* FROM `users`  WHERE (email LIKE '%e1404102281%')  ORDER BY admin DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `users`  WHERE (email LIKE '%e1404102281%')
---
  def index
    case params[:search_type]
    when 'email'
      @users = User.where('email LIKE ?', "%#{params[:keyword]}%")
    when 'phone'
      @users = User.where('phone LIKE ?', "%#{params[:keyword]}%")
    when 'nickname'
      @users = User.where('nickname LIKE ?', "%#{params[:keyword]}%")
    when 'vip'
      @users = User.where('is_vip = ?', true)
    else
      @users = User.order('admin DESC')
    end
    @users = @users.nil? ? User : @users
    hash = {}
    hash[:invitor_id] = params[:invitor_id] unless params[:invitor_id].blank?
    @users = @users.where(hash).order( params[:order_invitor] ? 'users_count DESC' : 'admin DESC').page(params[:page]).per(20)

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1
---
  def setvip
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `end_vip_time` = '', `is_vip` = 1, `start_vip_time` = '', `updated_at` = '2014-08-28 09:54:32', `vip_count` = 20 WHERE `users`.`id` = 24612
---
  def updatevip
    user = User.find(params[:id])
    user.is_vip = true
    user.is_vip = false if params[:user][:vip_count].blank? && params[:user][:start_vip_time].blank?
    user.vip_count = params[:user][:vip_count].to_s.to_i
    user.start_vip_time = params[:user][:start_vip_time] if params[:user][:start_vip_time]
    user.end_vip_time = params[:user][:end_vip_time]    if params[:user][:end_vip_time]
    user.save

SELECT  `users`.* FROM `users`  WHERE (agent=1)  ORDER BY id LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `users`  WHERE (agent=1)
---
  def agent_list
    @agents = User.where("agent=1").order("id").page(params[:page]).per(20)

SELECT  `judge_ranks`.* FROM `judge_ranks`   ORDER BY scores desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `judge_ranks`
---
  def judge_list
    @judges = JudgeRank.order("scores desc").page(params[:page]).per(20)

SELECT `clubs`.* FROM `clubs`  WHERE (end_date>'2014-09-01 00:00:00')  ORDER BY created_at
---
  def new
    @user = BatchUser.new
    #@agents = User.where("agent=true or is_judge=true")
    @clubs = Club.where("end_date>?",Time.zone.now.beginning_of_day).order("created_at")

SELECT  `batch_users`.* FROM `batch_users`   ORDER BY `batch_users`.`id` DESC LIMIT 1
SELECT  `users`.* FROM `users`  WHERE (email in (select email from batch_users where identifier='223_20_1415612677'))  ORDER BY created_at asc LIMIT 50 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM `users`  WHERE (email in (select email from batch_users where identifier='223_20_1415612677')) LIMIT 50 OFFSET 0) subquery_for_count
---
  def batch_index
    user_identifier = params[:identifier]
    user_identifier = BatchUser.last.identifier if params[:identifier].nil?
    @users = User.where("email in (select email from batch_users where identifier='#{user_identifier}')").order("created_at asc").page(params[:page]).per(50)

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1
---
  def batch_signup
    agent_id  = params[:agent_id]
    batch_count  = params[:batch_count]
    set_vip_count = params[:set_vip_count]
    vip_start = params[:vip_start_date]
    vip_end = params[:vip_end_date]

    return redirect_to admin_users_new_path, notice: '请选择邀请人' if agent_id.blank?
    return redirect_to admin_users_new_path, notice: 'VIP设置要有起期和止期' if vip_start.present? && !vip_end.present? || !vip_start.present? && vip_end.present?
    ls=('a'..'z').to_a
    ls.delete("o")
    ls.delete("l")

    today = Time.now
    day_yymmdd=today.strftime("%y%m%d")

    identifier = "#{agent_id}_#{batch_count}_#{Time.new.to_i}"
    #a130928+seq
    start_seq=0
    pre_user=BatchUser.find_by_sql("select max(seq) seq from batch_users where created_at > str_to_date('"+day_yymmdd+"','%y%m%d')")
    start_seq = pre_user[0].seq+1 if pre_user[0].seq

    agent = User.find(agent_id)

INSERT INTO `users` (`city`, `created_at`, `email`, `encrypted_password`, `invitor_id`, `nickname`, `password_salt`, `source`, `updated_at`, `vip_count`) VALUES ('上海', '2014-11-09 15:32:22', 'w141109115@ktz.cn', '2c032d09316b313ddd83d5470076a366f4272bf0c3a8b2cbf68f2cd6dac7516be4843c64ba8cc7fae976c83606a5a50a5576249acb2720736b19f4c5daaddb4a', 223, 'w141109115', 'ZzgyupoiGyetz_nBkk3o', 2, '2014-11-09 15:32:22', 10)
UPDATE `users` SET `users`.`updated_at` = '2014-11-09 14:18:54' WHERE `users`.`id` = 39646
---
      bu.seq = start_seq+i.to_i
      bu.password = "#{email}#{bu.seq}"
      bu.email = "#{bu.password}@ktz.cn"
      user_emails.push("'#{bu.email}'")