app/views/admin/orders/index.html.slim

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1
---
      td = o.source_type==0?"兑换":"淘宝"
      td = text_field_tag(:user_id,o.user.nickname, :disabled => true,:size => 3) if o.user.present?