app/views/admin/orders/show.html.slim

  string 兑换人:
  = @order.user.nickname if @order.user.present?
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1