app/views/admin/games/index.html.slim

SELECT `countries`.* FROM `countries`  WHERE (kind ='city')
---
  = label_tag '城市：'
  = select_tag(:city, options_for_select(Country.cities.map(&:name)) )

SELECT COUNT(*) FROM `rounds`  WHERE `rounds`.`game_id` = 794
---
      td = text_field_tag(:time,game.time_end, :disabled => true,:size => 12)
      td = game.rounds.count