app/views/users/_sides.html.slim

SELECT  `user_profiles`.* FROM `user_profiles`  WHERE `user_profiles`.`user_id` = 1061 LIMIT 1
---
    .icon_mine style="text-align:center"
      - unless @user.profile.blank?