app/views/home/index.html.slim

    |已经累计有
    span = User.count
---
SELECT COUNT(*) FROM `users`