app/views/game_vedios/my_shows.html.slim

SELECT  `game_records`.* FROM `game_records`  WHERE `game_records`.`game_vedio_id` = 4220  ORDER BY `game_records`.`id` DESC LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `games`.* FROM `games`  WHERE `games`.`id` = 794  ORDER BY priority DESC LIMIT 1
---
           td = link_to gv.vedio_time.strftime('%Y年%m月%d日%H时'), "/shows/#{gv.id}", target: '_blank'
           td = link_to gv.records.first.user.nickname, "/user/#{gv.records.first.user.id}"
           td = link_to gv.records.last.user.nickname, "/user/#{gv.records.last.user.id}"
           td = link_to "#{gv.game.country}/#{gv.game.city}/#{gv.game.place}", "/shows/#{gv.id}", target: '_blank'