app/views/admin/bags/index.html.erb

SELECT `bags`.* FROM `bags`  WHERE `bags`.`club_id` = 14
SELECT  `users`.* FROM `users`  WHERE `users`.`binding_code` = 'KT-CP-QC-140617-056' LIMIT 1
SELECT COUNT(*) FROM `users`  WHERE (binding_code='KT-CP-QC-140617-075')
---
  <% temp_bags=0 %>
  <% club.bags.each do |ba| %>
  <% temp_bags=temp_bags+User.where("binding_code=?",ba.code).count %>

SELECT COUNT(*) FROM `bags`  WHERE `bags`.`club_id` = 14
---
      temp_id=club.id %>
    <td align='center' rowspan="<%= club.bags.count %>"><%= club.name %></td>