app/views/weixin/w_users/index.html.slim

          td = format_time(item.subscribe_time) if item.subscribe_time
          td = item.user.present? ? "是" : "否"
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1