app/controllers/game_vedios_controller.rb

SELECT  `game_vedios`.* FROM `game_vedios`  WHERE `game_vedios`.`id` = 4220  ORDER BY created_at DESC LIMIT 1
---
  def show
    gv = GameVedio.find(params[:id])