app/controllers/home_controller.rb

  def index
    @slides = InfoUrl.where(usage: 'index_slide',status:true).order("priority desc")
    @shows = InfoUrl.where(usage: 'index_show')
---
SELECT `info_urls`.* FROM `info_urls`  WHERE `info_urls`.`usage` = 'index_slide' AND `info_urls`.`status` = 1  ORDER BY priority desc
SELECT `info_urls`.* FROM `info_urls`  WHERE `info_urls`.`usage` = 'index_show'

  def navAsyn
    @section = params[:section]
    @shows = InfoUrl.where(usage: "nav_#{@section}")
    #games
    @fgames   = Game.where("date>='#{Time.new.strftime("%Y-%m-%d")}'") if "forecast" == @section
    @rgames   = Game.where("date<='#{Time.new.strftime("%Y-%m-%d")}'").order("date desc") if "review" == @section
    #rank
    @scores = User.where("id != ?",123).order("scores desc").limit(10) if "rank1"== @section
    # 老的算法抛弃
    # @scores = User.all(:conditions => ["id != ?", 123], limit: 10, order: 'scores DESC') if "rank1"== @section
    @scores = League.all(:conditions => ["league_type = ? and status=?", League::LEAGUE_TYPES_STEADY,1], limit: 10, order: 'scores DESC') if "rank2"== @section
    @judges   = JudgeRank.order("scores desc").page(params[:page]).per(10) if "judge_ranks" == @section
    @gifts    = Gift.where("category = 0") if "exchange"== @section
---
SELECT `info_urls`.* FROM `info_urls`  WHERE `info_urls`.`usage` = 'nav_kt'
SELECT `games`.* FROM `games`  WHERE (date>='2014-08-28')  ORDER BY priority DESC
SELECT  `users`.* FROM `users`  WHERE (id != 123)  ORDER BY scores desc LIMIT 10
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `gifts`.* FROM `gifts`  WHERE (category = 0)

  def buy
    @gifts = Gift.where("category=1")
---
SELECT `gifts`.* FROM `gifts`  WHERE (category=1)