app/controllers/users_controller.rb

  def myorders
    @user = current_user
    @orders=Order.where(:user_id=>current_user.id,:source_type=>0)
---
SELECT `orders`.* FROM `orders`  WHERE `orders`.`user_id` = 1061 AND `orders`.`source_type` = 0

  def home
    @user = User.find(params[:user_id].to_i)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1