app/views/admin/users/index.html.slim

- cities = Country.cities.map(&:name)
---
SELECT `countries`.* FROM `countries`  WHERE (kind ='city')