app/controllers/weixin/w_services_controller.rb

  def find_service
    @w_service = WService.first
---
SELECT  `w_services`.* FROM `w_services`   ORDER BY `w_services`.`id` ASC LIMIT 1