app/controllers/weixin/w_users_controller.rb

  def unbind
  	wuser = WUser.find(params[:id])
  	if wuser.user_id
  		wuser.user_id=nil
  	end
  	wuser.save
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1061  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `w_users` SET `updated_at` = '2014-08-27 12:00:52', `user_id` = NULL WHERE `w_users`.`id` = 936